<?php
/**
 * chapter1 : 变量作用域
 * PHP 有四种不同的变量作用域：
 * local
 * global
 * static
 * parameter
 */

//==========================================global作用域==================================
/**
 * global 关键字用于函数内访问全局变量。在函数内调用函数外定义的全局变量，我们需要在函数中的变量前加上 global 关键字：
 */
echo "\n===========================global作用域====start==================\n";
$x = 5;
$y = 10;  // 全局变量

function myTest1()
{
    global $x, $y;
    $y = $x + $y;
}
myTest1();
echo $y;
echo "\n";

function myTest2() {
    global $x, $y;
    $GLOBALS['y'] = $GLOBALS['x'] + $GLOBALS['y'];
}
myTest2();
echo $y;
echo "\n===========================global作用域====end==================\n";


//===========================================Static 作用域======================================================
/**
 * 当一个函数完成时，它的所有变量通常都会被删除。然而，有时候您希望某个局部变量不要被删除。
 * 要做到这一点，请在您第一次声明变量时使用 static 关键字：
 */

echo "\n============================static作用域=================end=================================\n";
function myStaticTest()
{
    static $e=0;
    echo $e;
    $e++;
    echo PHP_EOL;    // 换行符
}

myStaticTest();
myStaticTest();
myStaticTest();
echo "\n============================static作用域=================start=================================\n";


//=============================参数作用域============================================
/**
 * 参数是通过调用代码将值传递给函数的局部变量。
 * 参数是在参数列表中声明的，作为函数声明的一部分：
 */
echo "\n=========================参数作用域start=====================================\n";
function myParameterTest($x)
{
    echo $x;
}
myParameterTest(5);
echo "\n=========================参数作用域end=====================================\n";

?>